{"title": "Prayer", "artist": "Kendrick Lamar", "lyrics": "[Verse 1]\nI was born on February 24th, 1970\nThe day I was delivered they said I would build a legacy\nPicture me with influence that last generations\nI was made out of love to keep you happy and educated\nThe first three letters of the alphabet my name\nI made you laugh, I made you dance, I made you sing\nI been around the world and back, you recorded my almanac\nSo dearly way before the fact me and pops was estranged\nMy father was a public figure, bigger than life\nLived as a winner, on stages alike\nRivers of people surely united, just to see our bond\nTime carried on, that was a common thread\nMy perfect father had many flaws\nStill they moved they legs and shook they heads in unison\nHe had more children, I was the oldest\nWe always played with each other 'fore they ruined 'em\nHe told me his personal secrets, childhood catching on beatings\nSexually touched and abused, never seen life in a school\nThe price of being iconic was demonic and screwed\nI stood on stage and had to watch my father on the news\nStress on the head of my spirit, I was lost and confused\nI knew both sides of the story, but still, I couldn't choose\nSee, it was more than humiliation and bein' sued\nThey crucified my affiliation for points to prove\nAnd now my purpose for livin' makes no difference to you\nMy total existence was for makin' a smiling move\nThey said that I'll live forever\nBut the moment he died, more accusations arrived\nI had to die too\n\n[Verse 2]\nI remember takin' my first breath August 28th, 1963\nThe whole nation had saved the day, I made it on TV\nMy come out was a standing ova', the crowd in disbelief\nHow could a group of words be so great?\nDesigned to make you think\nRaces and faces embracin' my conscience in letter form\nHow gracious was I speakin' on changes once outside the norm?\nThe person responsible, my creator\nHe never conformed or used hatred to form mass retaliation\nWatch him perform with conviction\nTwo hundred and fifty thousand souls left they homes to listen\nI gather his thoughts in abundance made to complete the mission\nHis life became heroic, then tables turned\nMy creator stripped from being a poet because he yearned\nOther women, infidelity stricken, I can't say he was perfect\nIt made me nervous, they tear him down and forget me\nI prayed that I survived in the midst of the controversy\nHow many lives'll fall on deaf ears if I'm not worthy?\nI won't justify his personal problems, that's not my job\nI was only born to make sure your children can play outside\nAnd I imagine the other demons he hid before he died\nIf they came to surface this dream probably won't be alive\nBecause of you\n\n[Verse 3]\nI was born in paranoia, it's poison for us\nWe can't create with joyous ambition, we're out of luck\nThe critics formed a new coalition and huddled up\nThe non-creators are now elated and out of touch\nWhy can't you gladly appreciate the influence we give?\nStop starin' at me disgusted, my substance made sure you'd lived\nYou want the head of the messenger and the history from him\nWhich eventually takes away from the good you accustom\nThink of a life without the likes of imagination that's prosperin'\nThe bodies that you consider genius, you like to box 'em in\nThe great debaters and thinkers, that gave you a voice\nWhy can't you prosecute the crimes and not the thoughts I employ?\nBecause your better judgement will always look down on me\nBut if I recollect how we connect, you'll account on me\nI got a theory that most of y'all won't allow to see\nIt goes like this, talent doesn't choose morality\nSee, if Daniel Hale was a killer, would you not want a heart?\nIf Carl Benz was a racist, would you stop driving cars?\nI can't help we jump in these bodies and you called them a god\nJust know the Earth is just a rock without the voices of art\nSincerely yours"}