{"title": "M.A.A.d city 2", "artist": "Kendrick Lamar", "lyrics": "(Volume increases with 2Pac talking in the background:)\n...It's gone be like Nat Turner, 1831\n\n[Intro/Refrain 1 & 2 - Kendrick Lamar]\nAye, on my mama, nigga\nI'ma be the greatest to ever do this shit\nOn, my mama, though, like\n\nBut, I told 'em \"I can't sugarcoat the answer for you\nThis is how I feel:\nIf somebody kill my son, that mean somebody getting killed\"\nTell me what you do for love\nLoyalty and passion of all the memories collected\nMoments you could never touch\nLet somebody touch my mama, touch my sister, touch my woman, touch my daddy, touch my niece, touch my nephew, touch my brothеr\nYou should chip a nigga ten toes or blow it in his lap\nMatter fact, I'm 'bout to spеak at this convention\nCall you back\n*phone and receiver encounter*\n\n[2Pac - Verse]\nBlack cop\nSteady stressin' Smith & Wesson's\nCount my blessings, class is in session\nThe worst question is the first question\nWhy do we work like slaves, sweating blades, to an early grave?\nNever got paid, but still we swear even the [?]\nAnswer that, then answer this, too\nThug's gonna get you; you know it's true\nLife's a bitch, true\nYou besta backtrack, and try to act black\nAnd live; not to be phony and bother-ive\nBut why be negative?\nWhat's the matter, G, black cat got your tongue\nFact: track got you sprung\nNow you hum (Do you feel me?)\nDum-dum-ditty, it's a meet\nAttention, reach each and every brotha' on the streets\nIf not peace, then at least let's get a piece\nI'm tired of seeing bodies on the street, deceased\nLooking through my high school yearbook\nReminiscing of the tears as the years took\nOne homie, two homie, three homies, poof!\nWe used to have juice, but now there's no more youth to shoot\nGod come save the [?]\nLost, ghetto souls of black Comp'n\n\n[Verse 2]\nYesterday, I got a call like from my dugle one on one\nSaid they killed his only son 'cause of insufficient funds\nHe was savvin', he was mobbin', way belligerent and drunk\nTalking out his head, philosphin' on what the Lord had done\nHe said, \"K. Dot, can you pray for me?\"\n\"It's been a fucked up day for me! I know that you anointed. Show me how to overcome!\"\nHe was lookin' for some culture, hopin' I could bring him closer\n[?] spiritual; my spirit do know better, but I told 'em\n\"I can't sugarcoat the answer for you, this is how I feel:\nIf somebody kill my son, that mean somebody getting killed\"\n\n[Refrain 1]\nTell me what you do for love\nLoyalty and passion of all the memories collected\nMoments you could never touch\n\n[Verse 3]\nI'd wait in front of murderers' spot and watch 'em his block\nI'd catch a nigga leavin' service, cause service is all I got\nI'd chip a nigga ten toes or blow it in his lap\nBrought myself to the court like \"Bitch, I did that\"\nHe say, \"Black Power [?] babies get killed by cowards\" (Ayiii)\nIf you can keep the peace, don't you fuck with one of ours\nIt be murder in the street, it'll be bodies in an hour\nGhetto bourby on the street, paramedics on the dial\n\n[Refrain 2]\nLet somebody touch my mama, touch my sister, touch my woman, touch my daddy, touch my niece, touch my nephew, touch my brother\nYou should chip a nigga ten toes or blow it in his lap\nMatter fact, I'm 'bout to speak at this convention\nCall you back!\n*phone and receiver encounter*"}