{"title": "Guilty Conscience", "artist": "Kendrick Lamar", "lyrics": "[Intro: Kendrick Lamar & [?]]\nPreviously\nHow the hell you gonna tell that man not to be violent?\n'Cause he don't need to go the same route that I went\nBeen there, done that\nAw, fuck it, what am I sayin'?\nShoot 'em both, Brady, where's your gun at? *Gunshots*\n\n[Verse 1: Kendrick Lamar & [?]]\nNow kill yourself\nWhy'd you say that?\n'Cause that's the American way plus it was fun\nMan, you a damn jack-\n-ass I know everyone wanna make me the scapegoat\nLike your the greatest of all time\nFuck you\nAsshole\nLet's stop the bickering\nThat's the last time you see me ignorant\nSo you can kill the thrills of thinking we're not different\nYeah, yeah, you're embarrassed aren't you?\nCouldn't control your arsenal\nMaybe the next time I'm persuading you, jump in the car pool\nSo what's your answer?\nMan you must have [?] your cracker\nOh no, another white joke, I'm laughing, how original?\nYou're asking for me to be on the shit that you on\nYeah, we can start with this cat named G Malone *Static*\n\n[Interlude]\n\"Meet G Malone, a west coast recording artist that's destined for stardom, but acknowledging the false hopes that lie within the music industry, he ponders the thought of going back to drug distribution. Feeling unsure of this decision (DJ rock star\nExclusive)...\"\n\n[Verse 2: Kendrick Lamar & [?]]\nHey G, remember me?\nIt's yo' conscience\nYou know, the voice in yo head that never had fed your nonsense?\nI know your getting famous and rather lifestyle is changing\nBut tell the truth\nThe music biz isn't what it seems, ain't it?\nDon't listen to em G\nKeep putting Watts on the map\nFuck that\nYou been gettin' money way before rap\nI say you go back hustlin'\nGather some sherm, pack, and a black magnum\nThrough Wyatt's mad dog and a pit bull if it watched\nStop, no need to be moving backwards\nBesides, your future brighter than half of these rappers\nSo what's the point of going back to the drug side?\n'Cuz everybody knows that G's certified\nWhat the fuck, you dumb as fuck\nOh, what, you jealous fool?\nCuz I know Malone, Keke Loc', and his brother Pool\nPlus the Seventh Street-\nMan you ain't nothin' but bad bitch\nAye, Malone, if your with it lemme get an ad-lib (yeah)\n\n[Interlude]\n\"Meet Jay Rock, former quote unquote 'Menace to Society', now Warner Brothers recording artist dealing with the sudden uncertainties of even having his first official single released. He finds himself struggling, daily to overcome the temptations triggering his old criminal ways.  At this moment, his conscience comes into play...\"\n\n[Verse 3: Kendrick Lamar & [?]]\nWatt's finest\nI told G he wit it\nHe said he bout to go OT\nForget it\nI won't let you fuck up Watt's career\nWoah, calm down\nSomebody's getting sensitive here\nYou fucking right because you know Jay Rock is my favorite\nMan you got a song with Lil Wayne and still ain't made it\nPlus you just had a baby\nSo I know that shit is stressin'\nKnow how much pampers cost ya\nWe live in a recession\nI suggest you rob tomorrow\nWhatever in sight, whatever you like\nAnd if that bitch resists tell that bitch goodnight\nLike that's gon' make a difference\nI know it will\nWhat, prison?\nI'm just sayin' what he like to do best\nWhat?\nStealin', robbin', jacking guys for nice cars\nLike the nigga did in 17\nDid you say nigga?\nIt was a joke you know what I mean\nI mean, I hope you know what I mean\nWhy you mad?\nYou [?]\nI mean, you said the same thing earlier\nWhat the fuck you worried for?\n[?] was a teen man\nYou trippin' man\nYou glitchin'\nYou don't get it\nYou a strike\nYou are different\nYou fuckin' right\nWhy the hells you gotta fuck with the future of Watts?\nOkay, okay\nLets see the choice he makes before his album drops *Static*"}