{"title": "Sherane a.k.a Master Splinter’s Daughter", "artist": "Kendrick Lamar", "lyrics": "[Intro]\nLord God, I come to you a sinner\nAnd I humbly repent for my sins\nI believe that Jesus is Lord\nI believe that You raised him from the dead\nI would ask that Jesus come to my life\nAnd be my Lord and Savior\nI receive Jesus to take control of my life\nAnd that I may live for him from this day forth\nThank you, Lord Jesus, for saving me with your precious blood\nIn Jesus' name, amen\n\n[Verse]\nI met her at this house party on El Segundo and Central\nShe had the credentials of strippers in Atlanta\nAss came with a hump, from the jump she was a camel\nI want to ride like Arabians, push an '04 Mercedes-Benz\n\"Hello, my name is Kendrick,\" she said, \"No, you're handsome\"\nWhispered in my ear, disappeared, then found her dancin'\nCiara had played in the background\nThe parade music we made had us all wearin' shades now, cool\n\"Where you stay?\" She said, \"Down the street from Dominguez High\"\nOkay, I know that's borderline Compton or Paramount\n\"Well, is it Compton?\" \"No,\" she replied\nThen quickly start battin' her eyes\nI strictly had wanted her thighs around me\nSeventeen with nothin' but pussy stuck on my mental\nMy motive was rather sinful, \"What you tryna get into?\"\nShe didn't tell, just gave me her Nextel\nDropped the number, we chirped the whole summer, and, well\nThe summer had passed, and now I'm likin' her\nConversation we havin' probably enticin' her\nWho can imagine? Maybe my actions'll end up wifin' her\nLove or lust, regardless, we'll fuck 'cause the trife in us\nIt's deep-rooted, the music of bein' young and dumb\nIs never muted, in fact, it's much louder where I'm from\nWe know a lot 'bout each other, her mother was a crack addict\nShe live with her granny and her younger two brothers\nHer favorite cousin Demetrius is irrepetible\nFamily history of gangbangin' did make me skeptical\nBut not enough to stop me from gettin' a nut\n\"I wanna come over, what's up?\"\nThat's what I told her soon as this episode\nOf Martin go off, I'm tryna get off\nI was in heat like a cactus\nMy tactics of bein' thirsty probably could hurt me\nBut fuck it, I got some heart\nGrabbed my mama keys, hopped in the car, then, oh boy\nSo now I'm down Rosecrans in a Caravan\nPassin' Alameda, my gas meter in need of a pump\nI got enough to get me through the traffic jam\nAt least I hope, 'cause my pockets broke as a promise, man\nI'm thinkin' 'bout that sex\nThinkin' 'bout her thighs or maybe kissin' on her neck or maybe what position's next\nSent a picture of her titties, blowin' up my texts\nI looked at 'em and almost ran my front bumper into Corvette\nEnthused by the touch of a woman, she's a masseuse\nAnd I'm a professional pornstar when off the Goose\nI had a fifth in the trunk like Curtis Jackson for ransom\nI'm hopin' to get her loose like an Uncle Luke anthem\nI'm two blocks away, two hundred and fifty feet\nAnd six steps from where she stay, she wavin' me 'cross the street\nI pulled up, a smile on my face, and then I see\nTwo niggas, two black hoodies, I froze as my phone rang\n\n[Outro]\nPlease leave your message for three-two-three\nRecord your message after the tone\nKendrick, where you at?\nDamn, I'm sittin' here waitin' on my van\nYou told me you was gon' be back in fifteen minutes\nMan, I gotta go up to the county buildin', man, these kids ready to eat\nI'm ready to eat, shit\nI gotta get them food stamps, come on now\nYou on your way or what?\nI hope you ain't out there messin' with them damn hoodrats out there, shit\n'Specially that lil' crazy-ass girl Sherane\nAnd plus you got school tomorrow\nYou keep fuckin' around in them streets, you ain't gon' pass to the next grade\nEleventh grade\n(Is that Kendrick on the phone?)\nYour daddy callin' about some damn dominoes (Let me holler at him)\nHe want to holler at you too, go ahead, Kenny, go'n, shit\nHello? Yak, where my motherfuckin' dominoes at?\n(Kenny), What?\nI'm on his voicemail, damn fool (Oh), shit\nYak, where my motherfuckin' dominoes at?\nThis the second time I asked you to bring my fuckin' dominoes\nJust give me the damn phone, shit, don't hang up, damn, let me\nKendrick, when you get this message, man, call me back (Keep losin' my goddamn dominoes, we gon' have to go in the backyard)\nI need to know when you gon' bring back my damn car (And squab, homie)\nThis man fussin' 'bout some damn dominoes\nIt ain't all that serious, fuck, damn dominoes\nShit, I'ma miss my damn appointment, fuck\nFuck some damn dominoes, nobody wanna hear that\nNobody wanna hear your ass\nMatter fact, cut my motherfuckin' oldies back on\nYou killin' my motherfuckin' vibe"}