{"title": "Come Up Freestyle*", "artist": "Kendrick Lamar", "lyrics": "[Intro]\nShout to my nigga Shellcase for doin' this beat for me too\nThat nigga look like a praying mantis\n\n[Verse 1]\nDrunk off a hard liquor, pourin' bottles over bitches\nPourin' halos over haters, killin' insecure niggas\nFeelin' like the old Jigga, old Nas\nOld BIG, new Pac, oh my God, he's alive, he raps\nBombs on your intellect\nBombin' everything from the streets to the internet\nGet the instrumental wet\nThen I'ma buss a nut, yeah I [?] my fuckin' nut\nThat is not an Escalade, that's a damn armor truck\nShoot who? Shot what?\nYou ain't popped shit but some bubblegum and a bump\nWho you motherfuckers want?\nLeave a motherfucker slump, from the fuckin' pump\nHe's a peanut to an elephant, put that nigga in the trunk\nMight be [?] in Houston\nLean in my pimp cup\nRidin' 84's, throw like a [?] pot\nHoes on my jock like I'm from the ATL\nAnd I know black choppers on the rooftop\nFlip a nigga like he was a NBA mascott\nStrip a nigga from his wavecap to his [?]\nGot it from my grandpop, was raised on them Compton blocks\nEvery day caught the fade, like we on the barbershop\nGoons in the parkin' lot\nOoh you's a fool if you bark a lot, with no bite\nLike [?] kill right\nIn front of your momma\nHold tight [?]\nSummertime, perfect for duck hunting\nAnd your women wanna be in my house\nWith her ass out, she climax then pass out\nLike promotional flyers, K Dot be the flyest\nEat ten rappers a day, now that's a hell of a diet\n\n[Chorus]\nYour girlfriend she all on me\nSay she wanna clean my dirty laundry\nSay she wanna clean my dirty laundry\nBitch I'm K Dot and I'm keepin' it friendly\n\n[Verse 2]\nI got this, jumpin' like a kangaroo\nPumpin' like a fist [?]\nFrom the pro black, this is automatic rap\nHave a seat, grab a snack, we gon' be here for a second\nArmageddon might be here, when I finish pray the Heaven has a home\nI'm alone in my own galaxy\nYou'll never have a headstart with a dead battery\nAnd they screamin' agony, when I write shit\nMy life is, filled with excitin'\nVisions of a nigga making mills with a strikin'\nImpact for ten years, I've been here before\nSee this is all premature\nI start the war like an instigator\nChopper, they some cream gaters\nOn a thursday, mix the Vodka with the Sprite\nBetter yet, roll the dice, watch me come up\nHe want to [?] with me, he cool, put your gun up"}