{"title": "Somebody", "artist": "Kendrick Lamar", "lyrics": "[Intro]\nI woke this mornin' undecided\nMy demons takin' over my life, yeah\nSooner or later it's a family divided\nThese patterns gettin' hard to hide, yeah\n\n[Chorus]\nThey say I should be satisfied\nThey tell me I got the world, but that's a lie\nI wished the way I feel could be pacified, sometimes\nI wish I was somebody\nAnybody but myself\nOh, I wish I was somebody\nAnybody but myself\n\n[Verse]\nIf I told you I'm 'bout to break would you look at me different?\nCharacter out of place, would I lose your attention?\nLet me know your intentions, cause lately I been watchin' everybody\nIt's apparent that transparency never seen monotony\nGot off of tour, lookin' for closure\nMixin' emotion of bein' grateful and feelin' like some of y'all gettin' over\nWhat's a puppet on stage, singin' and dancin' ablaze?\nBut trading his worth, distorted by the money that's made\nA slave with a verse, I feel like Prince Rogers\nI feel liberation is free, I feel I should miss the Oscars\nAre you celebrating me as the artist or just a profit?\nA question I have for the ones around me that's turnin' toxic\nMy lungs been heavy from all the smokescreen boobytraps\nReminiscin' on what it was, and knowin' that this ain't that\nI vision a rock in a hard place\nHope my daughter isn't born with a piece of my heartbreak\nYou know stress carries on and your kids reap the mistakes that you made\nAnd I admit that I can be dismissive if I can't relate\nAnd I admit that I only commit to start playin' games\nAnd I admit that I'm bad at talkin' myself out of shame\nBut who's to blame when the crowds stop cheerin' and they passin' dirty looks?\nI now understand that I'll never be understood\n\n[Bridge]\nIsolation didn't work for me (Work for me)\nSocializing didn't work for me\nPrayed about it, didn't work for me (Work for me)\nYou can't cure this disease\nThe pain too traumatic for relief\nPull up the curtains, let the audience see\n\n[Chorus]\nI wish I was somebody (Somebody else, oh, somebody else, oh)\nAnybody but myself  (Somebody else, oh)\nOh, I wish I was somebody  (Somebody else, oh)\nAnybody but myself"}