{"title": "​u", "artist": "Kendrick Lamar", "lyrics": "[Intro: Kendrick Lamar]\n*Screaming*\n\n[Chorus: Kendrick Lamar]\nLoving you is complicated, loving you is complicated\nLoving you is complicated, loving you is complicated\nLoving you is complicated, loving you is complicated\nLoving you is complicated, loving you is complicated\nLoving you is complicated, loving you is complicated\n\n[Verse 1: Kendrick Lamar]\nI place blame on you still, place shame on you still\nFeel like you ain't shit, feel like you don't feel\nConfidence in yourself, breakin' on marble floors\nWatchin' anonymous strangers, tellin' me that I'm yours\nBut you ain't shit, I'm convinced your tolerance nothin' special\nWhat can I blame you for? Nigga, I can name several\nSituations, I'll start with your little sister bakin'\nA baby inside, just a teenager, where your patience?\nWhere was your antennas?\nWhere was the influence you speak of?\nYou preached in front of one-hunnid-thousand but never reached her\nI fuckin' tell you fuckin' failure—you ain't no leader!\nI never liked you, forever despise you—I don't need ya!\nThe world don't need ya, don't let them deceive ya\nNumbers lie too, fuck your pride too, that's for dedication\nThought money would change you, made you more complacent\nFuckin' hate you, I hope you embrace it, I swear—\n\n[Chorus: Kendrick Lamar]\nLoving you is complicated, loving you is complicated\nLoving you is complicated, loving you is complicated\nLoving you is complicated, loving you is complicated\nLoving you is complicated, loving you is complicated\nLoving you is complicated, loving you is complicated\n\n[Post-Chorus: Kendrick Lamar]\nLovin' you, lovin' you, not lovin' you, 100° proof\nI can feel your vibe and recognize that you're ashamed of me\nYes, I hate you, too\n\n[Break: Jessica Vielmas]\n(Loving you ain't really complicated)\n\"Housekeeping, housekeeping\"\n(What I got to do to get to you?)\n\"¡Abre la puerta! ¡Abre la puerta tengo que limpiar el cuarto!\"\n(To you)\n\"¡Es que no hay mucho tiempo tengo que limpiar el cuarto!\"\n(Loving you ain't really complicated)\n\"¡Disculpe!\"\n(What I got to do to get to you?)\n(To you)\n\n[Beat Switch]\n\n[Verse 2: Kendrick Lamar]\nAre you the reason why mom and them leavin'\nNo, you ain't shit, you say you love 'em, I know you don't mean it\nI know you irresponsible, selfish, in denial, can't help it\nYour trials and tribulations a burden, everyone felt it\nEveryone heard it, multiple shots, corners cryin' out\nYou was deserted, where was your antennas again?\nWhere was your presence? Where was your support that you pretend?\nYou ain’t no brother, you ain’t no disciple, you ain’t no friend\nA friend never leave Compton for profit, or leave his best friend, little brother\nYou promised you’d watch him before they shot him\nWhere was your antennas? On the road, bottles and bitches\nYou FaceTimed him one time, that's unforgiven\nYou even FaceTimed instead of a hospital visit\nGuess you thought he'd recover well\nThird surgery, they couldn't stop the bleeding for real\nThen he died, God himself will say, \"You fuckin' failed,\" you ain't try\n\n[Break]\n*Sniffling*\n\n[Verse 3: Kendrick Lamar]\nI know your secrets, nigga, mood swings is frequent, nigga\nI know depression is restin' on your heart for two reasons, nigga\nI know you and a couple block boys ain't been speakin', nigga\nY'all damn near beefin', I see it and you're the reason, nigga\nAnd if this bottle could talk *gulping*\nI cry myself to sleep, bitch, everything is your fault\nFaults breakin' to pieces, earthquakes on every weekend\nBecause you shook as soon as you knew confinement was needed\nI know your secrets, don't let me tell 'em to the world\nAbout that shit you thinkin' and that time you *gulping*, I'm 'bout to hurl\nI'm fucked up, but I ain't as fucked up as you\nYou just can't get right, I think your heart made of bullet proof\nShould've killed yo' ass long time ago\nYou should've felt that black revolver blast a long time ago\nAnd if these mirrors could talk it'd say, \"You gotta go\"\nAnd if I told your secrets the world'll know money can't stop a suicidal weakness"}