{"title": "Reminiscing", "artist": "Kendrick Lamar", "lyrics": "[Chorus]\nSee, I was brought up different\nWhatever that my pops say, fasho I listened\nYou said you did dirt, but I can jig it\nIt don't deserve you, if you wasn't born in it\n(??)\nI swear we gotta fast forward (Fast forward, fast forward)\n(??)\nI swear we gotta fast forward (Fast forward, fast forward)\n\n[Pusha T - Verse]\nValentino summers and wave runners\nChains on my niggas like slave runners\nDrug Dealers Anonymous\nHow many Madonna's can that Mazda fit?\nMy brick talk is more than obvious; it's ominous\nGarage is the Phantom; ghouls, ghosts, and goblins\nBlonde-mohawk the collection, I'm Dennis Rodman\nThe money count is the only moment of silence\n'Cause hush money balances all this drugs and violence\nHat trick under my mattress, [?] stop still\nHas a(n) astеrisk after it\nAfter all, I can make a call\nI can baptizе a brick as I wash away my sins like a Catholic\nWho the fuck can't master this?\nAmerica's nightmares in Flint\nChildren of a lesser god when your melanin's a got a tint\nAnd I can't even mention what I sipped or what I spent\n'Cause my name and 18 wheelers is evident\nI put my boos in them Cruise Collections\nLife's a bitch, A-to-Z on her shoe collection\nTake your pick; paid in full like 86 G's on my body\nThe new Gucci has less monogram, God's got 'em\nLet he without sin cast the first stone, so I built that all glass quiet-level first home\nShadowed all your misconceptions, hold all them missing weapons\nYou thought I would miss my blessing\nThe ultimate mis-direction, yeah!\n\n[Chorus]\nSee, I was brought up different\nWhatever that my pops say, fasho I listened\nYou said you did dirt, but I can jig it\nIt don't deserve you, if you wasn't born in it\n(HO NIPSLE??)\nI swear we gotta fast forward (Fast forward, fast forward)\n(HO NIPSLE??)\nI swear we gotta fast forward (Fast forward, fast forward)\n\n[Verse]\nI can tell you what it is\nI can tell you what it isn't\nNo more K. Dot, my mother had named me Kendrick\nFuck the stage name that-the name that I was given\nThe only thing that I can identify with within this business\nJust a good kid from Compton that wanna rap\nWeighin' my options, pick up a bible or a strap\nI never killed a man, I never sold any crack\nAll I ever did was try to keep my city on the map\nBut, this monkey on my back: y'all don't want me to win\nI'm tryna follow dreams, you want me to follow trends\nSo, just to get a dollar, would I sell my soul?\nI look the Devil in the eye, and tell him, \"Hell, no\"\nThey say \"Anything worth having is worth the wait\"\nBut I want the world tell me how long that takes\nIt's no time like now\nI could cut my patience short or give 'em some more gowns\nI don't even want the crown, I just want the peace of mind\nAnd nigga, when I get it, you won't get a piece of mine\nWon't you mind your own business!\nA rich nigga buy anything you sell 'em\nA broke nigga believe anything that you tell 'em\nWell, I'm a broke nigga, but still I wouldn't listen to you even if your hand was on a Bible quote, nigga (Tuh!)"}