{"title": "Kendrick Lamar - For Free? (Tradução)", "artist": "Kendrick Lamar", "lyrics": "[Produzido por Terrace Martin]\n\n[Introdução: Darlene Tibbs]\nVai se foder, filho da puta, tu é um preto mariquinha\nNão sei por que tu tá tentando crescer, preto, tu não é ninguém\nAndando por aí como se fosse o presente de Deus à terra, preto, tu não é ninguém\nTu nem comprou um vestido bonito pra mim\nEu preciso de um grande e grosso pau brasileiro de 50 centímetros, tu é perda de tempo\nEu nem devia tá dando pra ti\nEu preciso de um preto rico e magnata\nTu é um preto liso e todo mundo sabe disso\nTeus manos sabem, todo mundo sabe, porra\nVai se foder, preto, não me liga mais\nVocê nem vai saber, vai perder uma mina boa\nMeu outro preto já é, tu já era\nQue porra é essa mermão?\n\n[Verso: Kendrick Lamar]\nEsse pau não é grátis!\nTu olha pra mim como se eu não fosse um recibo\nComo se eu nunca tivesse dado um jeito\nE comesse seus restos e carne crua\nEsse pau não é grátis!\nViver em cativeiro aumentou meu salário\nMe dizendo que verde é tudo que eu preciso\nSendo que tudo que eu vi foi carne de lata e sardinha\nEsse pau não é grátis, tipo, amor\nVocê realmente achou que a gente teria um filho chamado Mercedes\nSem uma Mercedes Benz e um aro 24 polegadas\nTinta 5% e saída de ar condicionado?\nMas nem fodendo! Esse pau não é grátis!\nEu preciso de quarenta acres e uma mula\nNão de quarenta gramas e um pitbull\nBesteira, abatedouro, abatedouro\nAlguém bateu na porta, deixe entrar, quem é?\nO melhor amigo da genitália -- esse pau não é grátis\nSinta pena do tolo que fez a beleza em você prosperar\nTetas grandes e lábios de buceta me mantiveram detestável\nMe mantiveram vendo pornô na pobreza; desculpas? Não\nAssisto você politizar com pessoas menos sortudas, como eu\nTodo cão tem seu dia, agora ficar de quatro deve ajudar\nEsse pau não é grátis!\nAliás, ele precisa de interesse\nAliás, ele tem 18 centímetros\nAliás, nossa amizade é apenas negócios\nPensão e mais pensão, você está beliscando meu dinheiro\nTem sido implacável, foda-se perdão, fodam-se seus sentimentos\nFodam-se suas fontes, toda distorção, se você foder, é mais abortos\nMais tribunais de divórcio e separação\nMeu cheque com menos endosso me deixou dormente\nEmpoeirado, condenado, enojado, forçado\nQue merda ainda tá faltando?\nA pressão estoura os canos de porcelana duas vezes\nA escolha está devastada, decapitado está o cavaleiro\nÓ América, sua puta má, eu catei algodão e te deixei rica\nE agora meu pau não é grátis!\n\n[Saída]\nVou fazer meu Tio Sam calar tua boca\nTu não é rei nenhum"}